import { Link, redirect, useNavigate } from 'react-router-dom';
import s from './footer.module.scss';
import { useAppDispatch } from '../../hooks/hooks';
import { logout } from '../../features/authForm/authSlice';
const Footer: React.FC = () => {
  const dispatch = useAppDispatch();
  const navigate = useNavigate();
  const handleLogout = () => {
    dispatch(logout()); // вызываем действие логаута
    navigate('/login'); // затем перенаправляем на экран логина
  };
  return <div className={s.footer}>
  <div className={s.container}>
    <div className={s.linksContainer}>
        <Link to="/milkProducts">Моя корзина</Link>
        <Link to="/meat">Мои заказы</Link>
        <Link to="/farmer/orders">Для фермеров</Link>
        <button onClick={handleLogout} className={s.logoutBtn}>
            Выйти из аккаунта
          </button>
      </div>
      <div className={s.iconContainer}>
          <img src="data:image/svg+xml,%3csvg%20width='33'%20height='21'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3cpath%20fill='%23969696'%20d='M11.725%202.188h8.653v15.723h-8.653z'/%3e%3cpath%20fill-rule='evenodd'%20clip-rule='evenodd'%20d='M12.273%2010.051a10.023%2010.023%200%200%201%203.777-7.863A9.81%209.81%200%200%200%202.675%203.266c-3.499%203.83-3.499%209.737%200%2013.567a9.81%209.81%200%200%200%2013.375%201.078%2010.023%2010.023%200%200%201-3.777-7.86z'%20fill='gray'/%3e%3cpath%20fill-rule='evenodd'%20clip-rule='evenodd'%20d='M32.051%2010.05c0%203.83-2.162%207.321-5.567%208.994a9.8%209.8%200%200%201-10.433-1.133%2010.04%2010.04%200%200%200%203.778-7.862%2010.04%2010.04%200%200%200-3.778-7.861%209.8%209.8%200%200%201%2010.433-1.133c3.405%201.673%205.567%205.165%205.567%208.993v.003z'%20fill='%23C2C2C2'/%3e%3c/svg%3e" alt="Search Icon" className={s.searchIcon} />
          <img src="data:image/svg+xml,%3csvg%20width='50'%20height='14'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3cpath%20fill-rule='evenodd'%20clip-rule='evenodd'%20d='M35.603%206.614v7.314h4.483V9.814h4.512c2.356%200%204.368-1.328%205.143-3.2H35.603z'%20fill='gray'/%3e%3cpath%20fill-rule='evenodd'%20clip-rule='evenodd'%20d='M35.402%200c.015.371.072.743.158%201.086.015.071.043.157.058.228.014.029.014.057.029.1a6.267%206.267%200%200%200%205.977%204.357H49.9c.057-.285.086-.571.086-.871a4.865%204.865%200%200%200-1.61-3.614A4.913%204.913%200%200%200%2045.044%200h-9.64z'%20fill='%23C2C2C2'/%3e%3cpath%20fill-rule='evenodd'%20clip-rule='evenodd'%20d='M27.658%201.471L24.526%208.23h-.316V0h-4.454v13.929h3.779c.991%200%201.896-.572%202.313-1.472L28.98%205.7h.316v8.229h4.454V0h-3.779c-.991%200-1.896.571-2.313%201.471zM6.897%201.829l1.867%206.4h.316l1.854-6.4A2.537%202.537%200%200%201%2013.376%200h4.455v13.929h-4.455V5.7h-.316l-2.557%208.229H7.328L4.77%205.7h-.316v8.229H0V0h4.454C5.589%200%206.58.743%206.897%201.829z'%20fill='gray'/%3e%3c/svg%3e" alt="Search Icon" className={s.searchIcon} />
          <img src="data:image/svg+xml,%3csvg%20width='39'%20height='24'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3cpath%20d='M39%2022.585c0%20.786-.645%201.415-1.45%201.415H1.45C.645%2024%200%2023.371%200%2022.585V1.415C0%20.629.645%200%201.45%200h36.1C38.355%200%2039%20.629%2039%201.415v21.17z'%20fill='%23CCC'/%3e%3cpath%20d='M14.827%206.97l-4.351%2010.113H7.629L5.48%209.013c-.107-.471-.269-.681-.645-.89a11.006%2011.006%200%200%200-2.632-.84l.054-.314h4.566c.59%200%201.128.367%201.236%201.048l1.128%205.87%202.793-6.865h2.847v-.053zm11.12%206.812c0-2.673-3.76-2.83-3.76-3.983%200-.367.376-.733%201.128-.838.376-.053%201.45-.105%202.632.471l.483-2.148c-.644-.21-1.45-.472-2.524-.472-2.633%200-4.513%201.363-4.513%203.354%200%201.467%201.343%202.253%202.364%202.725%201.02.472%201.396.786%201.396%201.258%200%20.68-.805.995-1.611.995-1.343%200-2.149-.367-2.74-.629l-.483%202.201c.645.262%201.773.524%202.954.524%202.794%200%204.62-1.362%204.674-3.458zm6.983%203.301h2.471L33.253%206.969h-2.31c-.537%200-.967.315-1.128.734l-4.03%209.38h2.794l.537-1.52h3.438l.376%201.52zm-3.008-3.563l1.397-3.773.806%203.773h-2.203zm-11.28-6.55l-2.203%2010.113h-2.686l2.202-10.114h2.686z'%20fill='%23666'/%3e%3c/svg%3e" alt="Search Icon" className={s.searchIcon} />
        </div>
  </div>
  </div>
  
};

export default Footer